# MajorStartOverhang Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricSheetType..::..MajorStartOverhang Property
FabricSheetType Class See Also
---
The distance from the edge of the sheet to the first wire (measured in the major direction).
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public double MajorStartOverhang { get; }
```

Visual Basic
---
```text
Public ReadOnly Property MajorStartOverhang As Double
	Get
```

Visual C++
---
```text
public:
property double MajorStartOverhang {
	double get ();
}
```

# See Also
FabricSheetType Class
Autodesk.Revit.DB.Structure Namespace